CSI API ETABS v1

# cDStAISC360_05_IBC2006 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStAISC360_05_IBC2006

    Public Interface cDStAISC360_05_IBC2006

    Dim instance As cDStAISC360_05_IBC2006

    public interface class cDStAISC360_05_IBC2006

    type cDStAISC360_05_IBC2006 =  interface end

The cDStAISC360_05_IBC2006 type exposes the following members.

Methods

| Name| Description
---|---|---
| [GetOverwrite](98ed21ad-e5fe-
fd17-2495-9305b1a38993.htm)|  Retrieves the value of a steel design overwrite
item.
|
GetPreference|  Retrieves the
value of a steel design preference item.
|
SetOverwrite|  Sets the value of a
steel design overwrite item.
|
SetPreference|  Sets the value of
a steel design preference item.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com